Revit 2027 API
DisplacementElement.GetAdditionalElementsToDisplace Method
 Identify a set of elements that potentially should be displaced along with a given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetAdditionalElementsToDisplace(
	Document document,
	View view,
	ElementId idToDisplace
)
Public Shared Function GetAdditionalElementsToDisplace (
	document As Document,
	view As View,
	idToDisplace As ElementId
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetAdditionalElementsToDisplace(
	Document^ document,
	View^ view,
	ElementId^ idToDisplace
)
static member GetAdditionalElementsToDisplace :
        document : Document *
        view : View *
        idToDisplace : ElementId -> ICollection<ElementId>
Parameters
document Document
 the document
view View
 the view
idToDisplace ElementId
 element id of element to displace
Return Value
ICollection<ElementId>
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 For example, when a wall is displaced, any inserts or hosted elements should also be displaced.
See Also
Reference
DisplacementElement Class
Autodesk.Revit.DB Namespace